tasks = {
    "🐍Python": {
        "🌟Easy": [
            "Выведите в терминале 'Hello, World'.",
            "Создайте две переменные: age и name. Задайте значение переменной age - 24,"
            "а также задайте значение переменной name - 'My name is Anton'."
            "Затем выведите их в терминале.",
            "Создайте четыре переменных: number1, number2, number3, number4. "
            "Задайте значение переменной number1 - 60, number2 - 25, number3 - 40, number4 - 30. "
            "Затем создайте переменную sum1 и присвойте ей значение суммы number1 и number2. "
            "Также создайте переменную sum2 и присвойте ей значение разницы number3 и number4. "
            "Выведите результат произведения sum1 и sum2, разделенный на 2."
        ],
        "⭐️Medium": [
            "Создайте список и назовите его list1. Впишите в него значения: [16, 3.5, 'man', False, 'python', True]. "
            "Выведите третий элемент списка (помните, что индексы начинаются с 0). "
            "Выведите сумму нулевого и первого элементов списка. "
            "Создайте строку, объединив второй и четвертый элементы через '+'. "
            "Создайте строку, объединив второй и четвертый элементы через запятую. "
            "Выведите последний элемент списка.",
            "Задача: Проверка доступа. "
            "Вы стали частью новой системы управления доступом. "
            "Напишите код через цикл for, который будет выводить 'элемент из списка - is number' "
            "для элементов списка list1, содержащего [1, 2, 3, 4, 5, 6]."
        ],
        "🔥Hard": [
            "Создайте два словаря: dictionary_1 с данными 'a': 300, 'b': 400, и dictionary_2 с данными 'c': 500, 'd': 600. "
            "Присвойте данные из второго словаря первому и выведите первый словарь.",
            "Создайте функцию sum, которая будет принимать произвольное количество чисел (**args). "
            "Проверяйте, положительное ли число, и если да, то суммируйте его с переменной num1 (изначально 0). "
            "Создайте также переменную num2 и делайте то же самое, но для отрицательных чисел.",
            "Напишите класс 'Person', который имеет следующие атрибуты: 'nick_name' (прозвище), 'gender' (пол),"
            "'birth_year' (год рождения) и 'email'. Определите метод 'full_info',"
            "который возвращает строку с полной информацией о человеке, включая прозвище, пол, год рождения и email."
            "Для получения ожидаемого вывода: 'Muhsathan Maratbekov Maratbekovich', 'male',"
            "born in 2007, email 'muhsathanm2007@gmail.com'."
        ]
    },
}


answers = {
    "🐍Python": {
        "🌟Easy": [
            "Hello World",
            "24"
            "\nMy name is Anton",
            "425.0"
        ],
        "⭐️Medium": [
            "19.5"
            "\nmanpython"
            "\nman python"
            "\nTrue",
            "Access granted",
            "1 - is a number"
            "\n2 - is a number"
            "\n3 - is a number"
            "\n4 - is a number"
            "\n5 - is a number"
            "\n6 - is a number"
        ],
        "🔥Hard": [
            " {'a': 300, 'b': 400, 'c': 500, 'd': 600}",
            "(11, -5)",
            "('Muhsathan Maratbekov Maratbekovich',) ('male',) born in (2007,) email ('muhsathanm2007@gmail.com',)"
        ]
    }
}

course_links = {
    "🐍Python": [
        "https://cloud.mail.ru/public/5EFe/vHEmvAbDY",
        "https://cloud.mail.ru/public/2hpR/2R1HRqLGG",
    ],
    "☕️Java": [
        "https://cloud.mail.ru/public/4tgV/CaNZS9edG",
        "https://cloud.mail.ru/public/53gK/4o8YdNHBt",
        "https://cloud.mail.ru/public/3eDz/3jf6epXnQ"
    ],
    "🛠️C++": [
        "https://disk.yandex.ru/d/l8LbOTWR6IDIJw",
    ]
}

book_link = "https://cloud.mail.ru/public/nMSg/xQYfhYyzc"